[
    {
        "name": "Enemy AI Test",
        "platforms": ["csharp"],
        "date": "1/1/2020",
        "environment": "Education",
        "description": "This project aimed to explore the effectiveness of implementing a weighted finite state machine compared to a standard finite state machine. As the number of states in a finite state machine increase, it becomes more challenging to manage. Therefore, this project sought to test how the weighted version, known for being easier to implement, would compare. A Hotline Miami style game created using Unity and C#. The two AI methods were integrated into the enemy AI and tested on participants to see if they could identify any differences between the two state machines. The results indicated that although users couldn't discern differences between the enemies, the weighted version proved to be more manageable and thus the preferable development option.",
        "contribution": "I developed the Hotline Miami-style game in Unity using C#, including all of the assets, player control, and random level generation. In addition to the game development, I also implemented both a finite state machine and a weighted finite state machine for the enemy AI. I sourced testers for the project and conducted tests with them to evaluate the effectiveness of the two AI methods. My work on this project showcases my expertise in game development, programming, and project management.",
        "github": "https://github.com/adam-steven/Game-AI-Comparison"
    },
    {
        "name": "Batch Audio Remover",
        "platforms": ["bash"],
        "date": "1/1/2021",
        "environment": "Personal",
        "description": "A Bash shell automated program designed to streamline the process of sanitizing large video datasets for AI training and sharing. Specifically, the program is designed to strip audio from every file within a specified folder, creating a new folder with the audio-free versions of all MP4 files contained in the original directory. Using this program significantly reduced the amount of time and effort required to prepare large video datasets for use in AI applications.",
        "contribution": "As the sole developer of this Bash program, I gained valuable experience in path selection, file gathering/processing, and user safety verification. I learned how to identify directories and files, extract and manipulate data efficiently, and implement safety measures to prevent unintended damage or data loss. The experience was rewarding and allowed me to develop my Bash scripting skills. The final product is a reliable tool for anyone looking to sanitize large video datasets for AI training and sharing.",
        "github": "https://github.com/adam-steven/Bash-Audio-Scrubber"
    },
    {
        "name": "Discord Bot",
        "platforms": ["nodejs", "javascript"],
        "date": "1/1/2023",
        "environment": "Personal",
        "description": "This Discord music bot project was developed using NodeJS and utilizes the YouTube API framework. The bot can search for music on YouTube and join a Discord channel to playing songs on user request. In addition to this, the bot is able to queue songs, play live streams, and detect when everyone has left the channel in order to automatically leave itself, saving processing power for the low-power computers it was designed to run on. This project showcases proficiency in NodeJS and utilizing APIs, as well as the ability to create practical and efficient solutions for real-world problems",
        "contribution": "As the developer on a team of two, I was responsible for researching, developing and implementing the entire software portion of the Discord music bot project. I conducted research into DiscordJs and the YouTube API framework to design and develop the bot's features with precision. One of my key contributions was implementing a persistent logging system for easy maintenance. Overall, my efforts were critical in creating a practical and user-friendly bot that runs smoothly and efficiently.",
        "github": ""
    },
    {
        "name": "Emotion Recognition",
        "platforms": ["csharp"],
        "date": "1/1/2019",
        "environment": "Education",
        "description": "This project focused on the development of an emotion recognition application using C# .NET Core. The objective was to explore various AI computer vision techniques and dataset sanitisation methods to improve prediction accuracy. The resulting application allowed users to upload image files, which were processed by the program to detect faces and predict the emotions associated with each face. Through a thorough analysis of pre-existing emotion detection algorithms and dataset gathering and cleaning techniques, the best methods were implemented to achieve a prediction accuracy of 77%.",
        "contribution": "My contribution to this project was multi-faceted and involved various aspects of development. I conducted research on emotion detection algorithms and implemented the most suitable ones to accurately predict emotions in images. Additionally, I moderated the AI dataset, ensuring that it was sanitised and suitable for the project's needs.\nAnother critical task was creating the graphical user interface (GUI) for the application. I developed an intuitive and user-friendly interface that allowed users to upload image files and view the emotion predictions for each face. I took a user-centered design approach to ensure that the application was accessible and easy to use.",
        "github": "https://github.com/adam-steven/AI-Emotion-Detection"
    },
    {
        "name": "GGJ 2018",
        "platforms": ["csharp"],
        "date": "1/1/2018",
        "environment": "Personal",
        "description": "As a participant in the 2018 Global Game Jam, my team came together to create a thrilling game in just 48 hours. The project involved navigating a boat through an archipelago while broadcasting a censored radio channel, all while avoiding the police. The game's unique style emulated a news feed of a high-stakes police chase. Using Unity and C#, we created a boat-themed 'chase' game that challenges players to stay afloat for as long as possible.",
        "contribution": "As one of two developers on a team of four, I was responsible for the character controller, GUI elements, item spawning, and item interaction. While my teammate focused on the enemy's complex AI. My work created a seamless gameplay experience and allowed players to navigate the game with ease. I collaborated closely with the artists and the other developer to ensure the success of our project, which was well received in the event.",
        "github": "https://globalgamejam.org/2018/games/pierat-radio"
    },
    {
        "name": "GGJ 2019",
        "platforms": ["csharp"],
        "date": "1/1/2019",
        "environment": "Personal",
        "description": "As part of the 2019 Global Game Jam, my team developed a challenging VR game in just 48 hours. We were fortunate enough to work with the Acer Mixed Reality VR headset, which allowed us to create a unique and immersive gaming experience. Our game revolved around the concept of interstellar travel, where the player must rotate a planet in 3D space to gain the necessary momentum to propel a seed to the next planet. The ultimate objective of the game is to reach the end planet, thus completing the challenging intergalactic journey.",
        "contribution": "As the artist in a two-person team, I played a vital role in creating the game world for our VR project, despite the limitations of my computer, which could not support VR. Working closely with the developer, designing visually striking assets, including planets, stars, and animations, which added an interactive element to the game.",
        "github": "https://globalgamejam.org/2019/games/acorn-fling"
    },
    {
        "name": "GGJ 2022",
        "platforms": ["csharp"],
        "date": "1/1/2022",
        "environment": "Personal",
        "description": "This project was a Unity game, created for the 2022 Global Game Jam. The game was developed in just 48 hours and featured a unique integration with the Twitch.tv chat API framework. Using C# programming, we designed the game to allow players on Twitch to participate in group decisions where they would vote on a car, which would then race down one of three different tracks. Each track had a different viewable outcome, and the game would add or remove points based on the group’s decisions. Overall, our game jam submission was a fun experiment that provided a great learning experience for unique APIs.",
        "contribution": "As one of two developers, I played a critical role in the success of the project by integrating the Twitch.tv chat API voting mechanic as well as producing/sourcing the game assets. My prior API programming skills came in handy for quickly learning and implementing the voting system, which allowed me to pick up the slack of not having a dedicated artist in bringing the game to life with graphics and sounds. Working collaboratively with my team member, we were able to complete the project within the 48-hour time limit and enjoyed a couple of hours playing the game on Twitch with other game jam participants.",
        "github": "https://globalgamejam.org/2022/games/driving-democracy-3"
    },
    {
        "name": "GHJ",
        "platforms": ["javascript", "html", "bootstrap", "css", "mysql", "php"],
        "date": "1/1/2020",
        "environment": "Work",
        "description": "An e-commerce platform for a Malaysian-based small business dealing in perfumes. The main challenge was to ensure that the website was user-friendly, catering to a non-technical client base, while maintaining the client's unique branding. As part of the development process, separate customer and admin interfaces were incorporated, enabling a dynamic product filtering system and product search functionality. To facilitate seamless transactions, the Stripe API was utilized to process payments. The result was a functional, and responsive online store that aimed at providing a hassle-free and enjoyable shopping experience for middle-aged women in Malaysia.",
        "contribution": "As the sole developer, I designed and developed the online perfume store from scratch, utilizing HTML, PHP, CSS, MySQL, and JavaScript. I also implemented the Stripe transaction API and configured the web host to ensure optimum performance. Throughout the project, I remained committed to the client's vision and the unique style and taste of the Malaysian market.",
        "github": ""
    },
    {
        "name": "GMTK 2021",
        "platforms": ["csharp"],
        "date": "1/1/2021",
        "environment": "Personal",
        "description": "The GMTK 2021 game jam was a thrilling opportunity for my team to showcase our skills and creativity in game development. In just 48 hours, we successfully created a unique and engaging wave-based survival game using Unity C#. Our game featured a gameplay mechanic that allowed the player to capture and link with enemies, adding their stats to their own and becoming stronger in the process. However, the player had to be careful in managing their links and choosing which enemies to capture, as if a linked enemy died, the player would die too. This added an exciting layer of strategy to the gameplay, as players needed to think ahead and make wise decisions about their links. Overall, our submission to the GMTK 2021 game jam was a fantastic experience that challenged us to work collaboratively and think creatively under a tight deadline.",
        "contribution": "As one of the developers on the team of 3 for the GMTK 2021 game jam submission, I played a critical role in bringing the game to life. My key contributions to the project included the creation of the player controller, the generic stats and weapon system, and the link system. These were essential gameplay features that allowed players to capture and link with enemies to gain their stats and weapons. Working collaboratively with the other developer on the team who was focused on enemy AI, we ensured that the main gameplay feature worked flawlessly. Our close collaboration and communication helped to overcome any technical challenges that we faced and allowed us to deliver a game that was engaging and enjoyable to play. Overall, I am proud of my contributions to the project and grateful for the opportunity to work with a talented team of developers and artists to create something truly special in just 48 hours.",
        "github": "https://megahold.itch.io/tever"
    },
    {
        "name": "Infinite Runner",
        "platforms": ["csharp"],
        "date": "1/1/2017",
        "environment": "Education",
        "description": "As part of my secondary school's game development course, I designed and developed an engaging infinite runner game using Unity and C#. The game features roguelike elements, allowing the player to select a unique ship with varying stats and test their abilities by dodging a plethora of randomly generated obstacle combinations. As the player progresses, the game becomes more challenging, but with the added benefit of unlocking new ships for future runs. This score-based 3D endless runner game showcases my proficiency in C# development and demonstrates my ability to create a enjoyable user experiences.",
        "contribution": "As the sole developer, I created the entire game, including all assets and level generation. I focused on designing engaging mechanics, a user-friendly interface, and a unique algorithm to generate an endless combination of challenging obstacles. Additionally, I created all the assets and ensured a cohesive visual style. My contributions demonstrate my ability to work independently, take on multiple responsibilities, and deliver a polished final product.",
        "github": "https://github.com/adam-steven/Endless-Runner-Game"
    },
    {
        "name": "Legacy System Adapter",
        "platforms": ["csharp"],
        "date": "1/1/2020",
        "environment": "Work",
        "description": "This project involved volunteering work for Ninewells Hospital, where the goal was to develop a custom data translator for the legacy system Pecos and an inventory organisation tool. The client relies on Pecos for inventory purchasing but faces the issue of accidental duplicate purchases due to the lack of a proper inventory documentation protocol. Thus, this project required the development of a C# system that could effectively process XML data from Pecos, adapt and modify it as necessary, and store it in the clients preferred inventory organization tool. Aiming to help streamline the clients inventory management processes and reduce the risk of purchasing errors.",
        "contribution": "As one of the developers in a 5-member team, I played a key role in managing online communication between team members and creating the output of our tool. I used my strong communication skills to ensure that everyone was informed of project developments and timelines, fostering an environment of collaboration and productivity. I was also responsible for designing, implementing and testing the XML output that our tool provided to the inventory organisation tool which involved researching and understanding the documentation for the data structure that the organisation tool required.",
        "github": ""
    },
    {
        "name": "Mac Printer Installer",
        "platforms": ["swiftui"],
        "date": "1/1/2022",
        "environment": "Work",
        "description": "The Mac printer driver installer project was a tool developed using SwiftUi. Its primary function was to streamline the process of installing and updating printer drivers on a user's Mac computer. The program was designed to automatically grab the most up-to-date driver from a server, install it in the root/cups folder of the user's computer, and run an Apple script to register the driver on the computer. Additionally, the software had the capability to check for driver updates every time the user’s pc started up and notify the user if a new driver was available. The project was a practical solution for users who were needing to use an organisations printers on their personal computers, providing an easy-to-use and efficient tool to streamline the process.",
        "contribution": "As the sole developer in a team of three, I created the entire Mac version of the printer driver installer based on the designer's spec document. I added features to enhance usability, such as the tool's adaptation to dark and light OS themes, and developed a custom logger for error handling. My contributions were critical in delivering a high-quality, functional solution that met the needs of our team and end-users.",
        "github": ""
    },
    {
        "name": "Mobile Game",
        "platforms": ["java", "google-firebase"],
        "date": "1/1/2020",
        "environment": "Education",
        "description": "The objective of this portfolio project was to develop an engaging and straightforward Android mobile game in Java, which featured a high-score saving functionality through integration with a Google Firebase Database, reminiscent of arcade score boards. The game leveraged the accelerometers and magnet field sensors of the phone to control the characters, and recorded individual high scores on the device. Furthermore, the application sent notifications to remind users to return and play the game if they had not done so in a few days.",
        "contribution": "My contributions to this project included setting up the Firebase Database for high score saving, creating the game's assets and mechanics (including the research and implementation of the unique control scheme), and implementing the user notification feature.",
        "github": "https://github.com/adam-steven/Mobile-Game"
    },
    {
        "name": "Motion Tracking Camera",
        "platforms": ["python", "aws", "php", "html", "javascript"],
        "date": "1/1/2021",
        "environment": "Education",
        "description": "This portfolio project comprises two primary components. Firstly, an efficient motion tracking system built on OpenCV (Python) that utilizes a loadable kernel module (LKM) to automatically centre the largest moving object within the camera's field of view. Secondly, an AWS EC2 instance that retrieves and stores video footage from the camera while also hosting a secure website that allows users to download the videos. The project was designed with a focus on optimizing performance on a Raspberry Pi Zero, using a stepper motor and USB webcam.",
        "contribution": "As the sole developer of this project, I developed the loadable kernel module (LKM) that enabled the motion tracker to work seamlessly and ensure that the largest moving object was always centred in the camera's frame. I also designed an efficient motion tracker and built a camera mount that allowed the solution to run effectively on a Raspberry Pi Zero.\nAdditionally, I configured the AWS EC2 instance to retrieve and store video footage from the camera and developed a secure website that enabled users to download these videos easily. My technical expertise and attention to detail were crucial to the successful completion of the project, and I'm proud of the impact my contributions will have.",
        "github": "https://github.com/adam-steven/Motion-Tracking-Camera"
    },
    {
        "name": "Outlook Add-In",
        "platforms": ["ejs", "nodejs", "javascript", "html", "bootstrap", "css"],
        "date": "1/1/2022",
        "environment": "Work",
        "description": "This project was an Outlook Add-in extension for the SharePortals. A powerful tool developed in NodeJs that empowers users to interact with the web application directly from their Outlook email client. The add-in provides seamless integration with the using custom APIs, allowing users to search for emails and save them directly to the SharePortals, streamlining the information management process. Additionally, the add-in enables users to create, update, and relate records directly from Outlook, ensuring that they can work with the web tool without leaving the email client. This level of integration and convenience was developed to help users to stay organized and focused, improving their productivity and making it easier to manage their information.",
        "contribution": "As the lead developer on the Outlook Add-in extension project, I made significant contributions to the project's success. I learned and developed the Outlook Add-in extension in its entirety, working closely with the designer to create a welcoming UI experience that was consistent with the main web app. Additionally, I worked alongside the API developer to ensure that the correct information was being passed between the two applications, making sure that the add-in was fully integrated with the main web app. Overall, this experience demonstrated my commitment to excellence and my ability to work effectively in a team leading a project.",
        "github": ""
    },
    {
        "name": "Physics Game",
        "platforms": ["csharp"],
        "date": "1/1/2022",
        "environment": "Personal",
        "description": "This physics-based roguelike project developed in Godot, C# was designed you speed in mind. The game featured wave-based stages with three distinct sections, requiring players to dodge, fight, and defeat bosses to progress to the next level. The end of each stage features a shop break, providing players with the opportunity to upgrade and prepare for the next level, which features even more challenging waves. The unique gimmick of this game is the explosive movement, allowing players to move forward with a single key press while bouncing off walls and enemies. This mechanic creates an exciting and fast-paced gameplay experience, where players must make sudden and bold moves to succeed.",
        "contribution": "As the sole developer of this physics-based roguelike project, I designed and programmed all aspects of the game, from the mechanics to the graphics and sound effects. This project provided an excellent opportunity to learn the C# programming structures that Godot encourages and helped me improve my object-oriented programming methodology. Despite the limited documentation and programming challenges, I remained dedicated to delivering a high-quality game that players would enjoy. This project helped me gain valuable skills that will undoubtedly be useful in my future programming endeavours.",
        "github": ""
    },
    {
        "name": "Portfolio V2",
        "platforms": ["reactjs", "nodejs", "javascript", "typescript", "html", "bootstrap", "sass", "css"],
        "date": "1/1/2023",
        "environment": "Personal",
        "description": "This web portfolio was created using ReactJs to showcase some of my understanding of this popular JavaScript framework. As someone who frequently uses React for prototype development, I was eager to demonstrate my skills by building this functional website. And although I have not work on a full-scale project in React, hopefully this project highlights my ability to utilise ReactJs to create dynamic web applications. As a developer, I would be enthusiastic about the opportunity to apply my React expertise to a larger project and further expand my knowledge of this powerful framework.",
        "contribution": "",
        "github": ""
    },
    {
        "name": "Printer Failure Detection",
        "platforms": ["python"],
        "date": "1/1/2021",
        "environment": "Education",
        "description": "My honours project, this involved designing a 3D printer failure detection system that utilized OpenCV in Python. The project goal was to investigate various methods for detecting if a print in progress failed and devising ways to alert the user of the failure. The result, a software application that employed a camera facing the printer to detect any significant movement on the X-axis during printing. If movement was detected, the software would activate an audible alarm and send an email notification to the user. To validate the effectiveness of the system, I implemented the software on a Raspberry Pi 3 and tested it under real-world conditions as well as of 200 video samples. This project provided an excellent opportunity to implement the research and development techniques I had built up over my years at university.",
        "contribution": "As the sole developer, I reviewed and improved on the pre-existing object detection system research, implementing best practises for the failure detection, GUI, and user alert software. I focused closely on integrating the software with the camera and other components. The final product was a reliable 3D printer failure detection system that met or exceeded all my initial project goals.",
        "github": "https://github.com/adam-steven/3D-Printer-Failure-Detection"
    },
    {
        "name": "Secure Messaging System",
        "platforms": ["csharp", "mysql"],
        "date": "1/1/2019",
        "environment": "Education",
        "description": "A peer-to-server messaging system using the C# .NET Framework. This system was designed to facilitate secure online communication, with a focus on preserving user privacy. To achieve this, the application implemented end-to-end and data-at-rest encryption. The messaging system allowed for private one-on-one conversations and notified users when they received new messages. Along with this, the messages were securely stored on a MySQL database, ensuring that users could access their previous conversations when logging in. The system supported multiple client applications that communicated with the server to transfer data securely to its intended recipient. Overall, this project demonstrated proficiency in C# programming and an understanding of secure messaging protocols.",
        "contribution": "My contributions to this project included developing the GUI, creating the MySQL database, and implementing security measures to ensure user privacy. Specifically, I designed an intuitive user interface that facilitated seamless interaction with the messaging system, as well as created a MySQL database to securely store all user data, including encrypted messages. I implemented security measures, such as end-to-end and data-at-rest encryption, to protect user privacy. Additionally, I enabled secure data transfer between clients and the server using SimpleTCP. My expertise in C# programming, network programming, secure messaging protocols, and user experience design were instrumental in creating a functional, secure, and user-friendly messaging system.",
        "github": "https://github.com/adam-steven/Secure-Messaging-System"
    },
    {
        "name": "SharePortals",
        "platforms": ["javascript", "csharp", "html", "bootstrap", "sass", "aspnet", "css", "azure"],
        "date": "1/1/2023",
        "environment": "Work",
        "description": "This information management web tool is a dynamic and powerful platform designed to help users store and manage their data with ease. Developed in ASP.Net, the web tool integrates seamlessly with Microsoft SharePoint and other Office 365 applications to provide users with full access to their stored data. With its robust and flexible architecture, the web tool enables users to create and customize records, store attributes, and attach documents, such as word files, emails, and planner tasks, to their records. In addition, the web tool allows users to establish relationships between different records, giving them the flexibility to configure the system to their specific needs.",
        "contribution": "As a full stack developer on the Information Management Web Tool project, I played a key role in developing and implementing several features of the web tool. My contributions included debugging and refactoring the application for improved stability and performance. Additionally, I implemented various features such as MS Planner integration, MailChimp integration, a customizable dashboard, and user application themes using Sass. It is a fulfilling experience to see the positive impact I have contribute to this application.",
        "github": ""
    },
    {
        "name": "Word Scramble Game",
        "platforms": ["javascript", "typescript", "csharp", "html", "bootstrap", "sass", "aspnet", "css", "mysql"],
        "date": "1/1/2023",
        "environment": "Personal",
        "description": "This web game project was developed using ASP.Net and combined elements of the popular word game, Wordle, with a word scramble game. The objective was to unscramble as many words as possible within a 5-minute timeframe. The server generated a new set of scrambled words every day, adding to the challenge and excitement of the game. The scoring system rewarded players for finding words with a high number of letters and prompted them to continue searching for new words by generating new scrambled words after each successful guess. Once the time limit expired, the game ended, and players had to wait for the following day to play again. This project highlights my skill in creating an engaging and interactive UX design for website, package in a fun game format.",
        "contribution": "As the sole developer of this web game project, I designed and programmed a user-friendly interface that allowed anonymous users to play the game without needing to create an account. I created a system to track each user's progress day to day, ensuring a seamless experience for players who returned to the game. I also aimed to developed effective security measures to prevent cheating, such as ensuring that the server-generated scrambled words were not accessible via the web console or that users could not easily access the JS functions through object-orientated design.",
        "github": ""
    },
    {
        "name": "Word Scroll Game",
        "platforms": ["javascript", "html", "css"],
        "date": "1/1/2021",
        "environment": "Personal",
        "description": "An infinite word scrolling website game. This project began as a JavaScript-heavy website imagined to be a pointless experience for users to find, question, and talk about. However, as development progressed, we added 'find the secrets' game elements to create a more engaging experience for players. The objective of the game was to uncover all of the unique words hidden within the ever-scrolling digital landscape.",
        "contribution": "Working in a team of 3 members, I was the main developer for this project. Having the responsibility of bringing the site manager's vision to life: adapting to their new ideas and constructive critiques while also standing my ground in preventing feature creep on what was a small fun side-project. In addition, I collaborated with the idea/asset creator to integrate their creations into the game and create a seamless experience for the player. Overall, I am proud of the contributions that our team made to this project, and I believe that our collaboration had resulted in an entertaining game experience.",
        "github": "https://adam-steven.github.io/webgame/index.html"
    }
]